/* 
  Localizable.strings
  ObjectiveC_Extension

  Created by Vitor Marques de Miranda on 29/09/17.
  Copyright © 2017 VitorMM. All rights reserved.
*/

// Misc
"OK" = "OK";
"Cancel" = "Annuler";
"Yes" = "Oui";
"No" = "Non";

// NSAlert Extension
"Success" = "Succès";
"Warning" = "Attention";
"Error" = "Erreur";

// NSData Extension
//"Error while reading file data: %@" = "Erro enquanto lia dados de arquivo: %@";

// NSString Extension
"Error while reading file: %@" = "Erreur lors de la lecture du fichier: %@";
"Error while writting file: %@" = "Erreur lors de l'écriture du fichier: %@";

// NSFileManager Extension
"Error while creating symbolic link: %@" = "Erreur lors de la création d'un lien symbolique: %@";
"Error while creating folder: %@" = "Erreur lors de la création du dossier: %@";
"Error while moving file: %@" = "Erreur lors du déplacement du fichier: %@";
"Error while copying file: %@" = "Erreur lors de la copie du fichier: %@";
"Error while removing file: %@" = "Erreur lors de la suppression du fichier: %@";
"Error while listing folder contents: %@" = "Erreur lors du listage du contenu du dossier: %@";
//"Error while listing folder contents: %@ doesn't exist." = "Erro enquanto listava o conteúdo de pasta: %@ não existe.";
//"Error while listing folder contents: %@ is not a folder." = "Erro enquanto listava o conteúdo de pasta: %@ não é uma pasta.";
//"Error while retrieving symbolic link destination: %@" = "Erro enquanto obtia destino de link simbólico: %@";

// NSTask Extension
//"Path for %@ not found." = "Caminho para %@ não encontrado.";
//"File %@ not found." = "Arquivo %@ não encontrado.";
//"File %@ not runnable." = "Arquivo %@ não é executável.";
//"Directory %@ does not exists." = "Diretório %@ não existe.";

